In [6]:
import pandas as pd
import sqlite3 as sql

In [7]:
conn = sql.connect('sql-murder-mystery.db')

In [8]:
print(conn)

<sqlite3.Connection object at 0x15c0bca90>

In [9]:
query_1 = '''
SELECT *
FROM crime_scene_report
WHERE city = "SQL City"
and date= 20180115;
'''
pd.set_option('display.max_colwidth', None)
pd.read_sql_query(query_1, conn)

,date,type,description,city
0,20180115,assault,"Hamilton: Lee, do you yield? Burr: You shot him in the side! Yes he yields!",SQL City
1,20180115,assault,Report Not Found,SQL City
2,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

In [10]:
query_2 = '''
SELECT *
FROM Person
WHERE address_street_name ='Northwestern Dr'
ORDER BY address_number desc;
'''

In [11]:
pd.read_sql_query(query_2, conn)[:1]

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [19]:
query_3 = '''
SELECT *
FROM Person
WHERE address_street_name ='Franklin Ave'
and name like "Annabel%"
ORDER BY address_number desc;
'''

In [20]:
pd.read_sql_query(query_3, conn)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [14]:
pd.read_sql_query("select * from interview where person_id=16371 or person_id=14887;", conn)

,person_id,transcript
0,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."
1,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

In [15]:
pd.read_sql_query("SELECT * FROM get_fit_now_member WHERE membership_start_date < 20180109 AND membership_status = 'gold' and id like '48Z%';", conn)

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [16]:
pd.read_sql_query("SELECT * FROM drivers_license where plate_number like '%H42W%' and gender='male';", conn)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
1,664760,21,71,black,black,male,4H42WR,Nissan,Altima

In [17]:
pd.read_sql_query("SELECT * FROM person WHERE license_id=423327 or license_id=664760;", conn)

,id,name,license_id,address_number,address_street_name,ssn
0,51739,Tushar Chandra,664760,312,Phi St,137882671
1,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279

In [18]:
print("culprit is JEREMY BOWERS" )

culprit is JEREMY BOWERS

In [21]:
print('''
      REPORT:
      
      1. Firstly we have the information that the murder happened on 1st January 2018 and in SQL city. So we sorted the dta according to that.
      
      2. The murder entry from that day gave us the following information:- "Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave"."
      
      3. So we sorted the house data of the 'Northwestern Dr' in decreasing order to find the number of the last house which is owned by witness 1.
      
      4. Next we find Anabell from the Franklin Eve who is witness 2.
      
      5. After we get the IDs of these two people, we checked their interrogation entries to find more information.
      
      6. We got this: 
      
      Person 1:- "I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W"
      
      Person 2:- "I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th"
      
      7. From this we got to knowthe following things:
      
            1. The culprit is a man.
            2. He has a "Get Fit now Gym" bagpack which is only given to Gold members of the gym.
            3. The culprit has a car whose number plate includes the digits "H42W".
            4. The sighting happend on 9th January.
            
      8. Taking this we checked the Gym's database and found two such people.
      
      9. After checking the car number, we finally got our culprit.
      
      10. The culprit is Mr. Jeremy Bowers.
      
      ''')

      REPORT:

      1. Firstly we have the information that the murder happened on 1st January 2018 and in SQL city. So we sorted the dta according to that.

      2. The murder entry from that day gave us the following information:- "Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave"."

      3. So we sorted the house data of the 'Northwestern Dr' in decreasing order to find the number of the last house which is owned by witness 1.

      4. Next we find Anabell from the Franklin Eve who is witness 2.

      5. After we get the IDs of these two people, we checked their interrogation entries to find more information.

      6. We got this:

      Person 1:- "I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W"

      Person 2:- "I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th"

      7. From this we got to knowthe following things:

            1. The culprit is a man.
            2. He has a "Get Fit now Gym" bagpack which is only given to Gold members of the gym.
            3. The culprit has a car whose number plate includes the digits "H42W".
            4. The sighting happend on 9th January.

      8. Taking this we checked the Gym's database and found two such people.

      9. After checking the car number, we finally got our culprit.

      10. The culprit is Mr. Jeremy Bowers.